       IDENTIFICATION DIVISION.
       PROGRAM-ID. PRUEBA.
       DATA DIVISION.
       WORKING-STORAGE SECTION.
       01 NUM1 PIC S99V99.
       01 NUM2 PIC S99V99.
       01 AUX PIC 9.
       01 RESUL PIC S9(4)V9(4) VALUE 1.
       01 OPCION PIC 9 VALUE 0.
       PROCEDURE DIVISION.
       MAIN-PROCEDURE.
       DISPLAY "ESTA CALCULADORA SOLO ACEPTA OPERANDOS DE DOS DIGITOS".
      *CICLO A REPETIR
           CALCULAR.
            DISPLAY "INGRESE LA OPERACION A REALIZAR"
            DISPLAY "0 PARA SALIR"
            DISPLAY "1 PARA SUMAR"
            DISPLAY "2 PARA RESTAR"
            DISPLAY "3 PARA MULTIPLICAR"
            DISPLAY "4 PARA DIVIDIR"
            DISPLAY "5 PARA POTENCIAR"
            ACCEPT OPCION
            IF OPCION = 0 THEN
                GO TO TERMINAR
            END-IF
            DISPLAY "INGRESE DOS OPERANDOS"
            ACCEPT NUM1
            ACCEPT NUM2
      *SUMA
            IF OPCION = 1 THEN
                ADD NUM1 TO NUM2 GIVING RESUL
                DISPLAY "LA SUMA ES: "RESUL
            END-IF
      *RESTA
            IF OPCION = 2 THEN
                SUBTRACT NUM2 FROM NUM1 GIVING RESUL
                DISPLAY "LA RESTA ES: "RESUL
            END-IF
      *MULTIPLICACION
            IF OPCION = 3 THEN
                MULTIPLY NUM2 BY NUM1 GIVING RESUL
                DISPLAY "LA MULTIPLICACION ES: "RESUL
            END-IF
      *DIVISION
            IF OPCION = 4 THEN
                DIVIDE NUM1 BY NUM2 GIVING RESUL
                DISPLAY "LA DIVISION ES: "RESUL
            END-IF
      *POTENCIA / DESCARTO LA PORCION DECIMAL DE NUM2 PARA REPETIR MI CICLO
      *NOTESE LA POTENCIA NO ACEPTA EXPONENTES NEGATIVOS NI DECIMALES, TAMPOCO MAYORES A 9(POR CONVENCION)
                IF OPCION = 5 THEN
                MOVE NUM2 TO AUX
                MOVE 1 TO RESUL
                PERFORM AUX TIMES
                MULTIPLY NUM1 BY RESUL GIVING RESUL
                END-PERFORM
                DISPLAY "LA POTENCIA ES: "RESUL
            END-IF

            GO TO CALCULAR.

           TERMINAR.
            DISPLAY "HA SALIDO DEL PROGRAMA"
            STOP RUN.
       END PROGRAM PRUEBA.
